<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"06448bc94cdaa51cbb19498d62c7f9c30486ffdfe5d0a90fbeeccde99999efc9","plan_job_ref":"Job PR on main for docs #5 at https://github.com/softkitit/softkit-core/actions/runs/9469416396","plan_out_hash":"aebe2059d189c8fd5685b008d622440a2bf43e423b4f9295c5d69767671215a6","plan_hash":"202c8a84e3c16ae5c0c525adefd68cda1b1e2068e6ba310d22f037f5e6053328","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __apps/docs/terraform/__
With backend config files: `apps/docs/terraform/backends/prod.s3.tfbackend`
With var files: `apps/docs/terraform/vars/prod.tfvars`
<details>
<summary>Plan: 33 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_response_headers_policy.website-security-policy will be created
+   resource "aws_cloudfront_response_headers_policy" "website-security-policy" {
+       comment = "policy to handle caching and security headers"
+       etag    = (known after apply)
+       id      = (known after apply)
+       name    = "prod-softkit-core-caching-and-security-policy"

+       cors_config {
+           access_control_allow_credentials = false
+           origin_override                  = true

+           access_control_allow_headers {
+               items = [
+                   "*",
                ]
            }

+           access_control_allow_methods {
+               items = [
+                   "GET",
+                   "OPTIONS",
                ]
            }

+           access_control_allow_origins {
+               items = [
+                   "docs.softkit.dev",
                ]
            }
        }

+       custom_headers_config {
+           items {
+               header   = "Cache-Control"
+               override = true
+               value    = "public, max-age=15552000"
            }
        }

+       security_headers_config {
+           content_type_options {
+               override = true
            }
+           frame_options {
+               frame_option = "DENY"
+               override     = true
            }
+           referrer_policy {
+               override        = true
+               referrer_policy = "strict-origin-when-cross-origin"
            }
+           strict_transport_security {
+               access_control_max_age_sec = 31536000
+               override                   = true
            }
+           xss_protection {
+               mode_block = true
+               override   = true
+               protection = true
            }
        }
    }

  # module.acm_request_certificate.aws_acm_certificate.default[0] will be created
+   resource "aws_acm_certificate" "default" {
+       arn                       = (known after apply)
+       domain_name               = "docs.softkit.dev"
+       domain_validation_options = [
+           {
+               domain_name           = "docs.softkit.dev"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "docs.softkit.dev",
        ]
+       tags                      = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                  = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm_request_certificate.aws_route53_record.default["docs.softkit.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.acm_request_certificate_redirect.aws_acm_certificate.default[0] will be created
+   resource "aws_acm_certificate" "default" {
+       arn                       = (known after apply)
+       domain_name               = "www.docs.softkit.dev"
+       domain_validation_options = [
+           {
+               domain_name           = "www.docs.softkit.dev"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "www.docs.softkit.dev",
        ]
+       tags                      = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                  = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm_request_certificate_redirect.aws_route53_record.default["www.docs.softkit.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.cdn.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
+       id                      = (known after apply)
+       json                    = (known after apply)
+       source_policy_documents = (known after apply)
    }

  # module.cdn.data.aws_iam_policy_document.s3_website_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_website_origin" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = [
+           (known after apply),
        ]

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               "arn:aws:s3:::softkitit-prod-softkit-core-origin/*",
            ]
+           sid       = "S3GetObjectForCloudFront"

+           condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.cdn.aws_cloudfront_distribution.default[0] will be created
+   resource "aws_cloudfront_distribution" "default" {
+       aliases                         = (known after apply)
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "Managed by Terraform"
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                        = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true
#        (1 unchanged attribute hidden)

+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 404
+           response_code         = 404
+           response_page_path    = "/404.html"
        }

+       default_cache_behavior {
+           allowed_methods            = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           cache_policy_id            = "************************************"
+           cached_methods             = [
+               "GET",
+               "HEAD",
            ]
+           compress                   = true
+           default_ttl                = 0
+           max_ttl                    = 0
+           min_ttl                    = 0
+           response_headers_policy_id = (known after apply)
+           target_origin_id           = "***************************"
+           trusted_key_groups         = []
+           trusted_signers            = []
+           viewer_protocol_policy     = "redirect-to-https"
        }

+       origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = (known after apply)
+           minimum_protocol_version       = "TLSv1.2_2021"
+           ssl_support_method             = (known after apply)
        }
    }

  # module.cdn.aws_cloudfront_origin_access_identity.default[0] will be created
+   resource "aws_cloudfront_origin_access_identity" "default" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "softkitit-prod-softkit-core"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # module.cdn.aws_s3_bucket.origin[0] will be created
+   resource "aws_s3_bucket" "origin" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "softkitit-prod-softkit-core-origin"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes"  = "origin"
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core-origin"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                    = {
+           "Attributes"  = "origin"
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-softkit-core-origin"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       website {
+           index_document = "index.html"
#            (2 unchanged attributes hidden)
        }
    }

  # module.cdn.aws_s3_bucket_acl.origin[0] will be created
+   resource "aws_s3_bucket_acl" "origin" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)
    }

  # module.cdn.aws_s3_bucket_cors_configuration.origin[0] will be created
+   resource "aws_s3_bucket_cors_configuration" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "docs.softkit.dev",
            ]
+           expose_headers  = [
+               "ETag",
            ]
            id              = null
+           max_age_seconds = 3600
        }
    }

  # module.cdn.aws_s3_bucket_ownership_controls.origin[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "origin" {
+       bucket = "softkitit-prod-softkit-core-origin"
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.cdn.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = "softkitit-prod-softkit-core-origin"
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.cdn.aws_s3_bucket_public_access_block.origin[0] will be created
+   resource "aws_s3_bucket_public_access_block" "origin" {
+       block_public_acls       = true
+       block_public_policy     = false
+       bucket                  = "softkitit-prod-softkit-core-origin"
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = false
    }

  # module.cdn.aws_s3_bucket_server_side_encryption_configuration.origin[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.cdn.aws_s3_bucket_versioning.origin[0] will be created
+   resource "aws_s3_bucket_versioning" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Disabled"
        }
    }

  # module.cdn.random_password.referer[0] will be created
+   resource "random_password" "referer" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.cdn.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
+   resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
+       create_duration  = "30s"
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

  # module.cdn_redirect.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
+       id                      = (known after apply)
+       json                    = (known after apply)
+       source_policy_documents = (known after apply)
    }

  # module.cdn_redirect.data.aws_iam_policy_document.s3_website_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_website_origin" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = [
+           (known after apply),
        ]

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "S3GetObjectForCloudFront"

+           condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.cdn_redirect.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.cdn_redirect.data.aws_region.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.cdn_redirect.aws_cloudfront_distribution.default[0] will be created
+   resource "aws_cloudfront_distribution" "default" {
+       aliases                         = (known after apply)
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "Managed by Terraform"
+       continuous_deployment_policy_id = (known after apply)
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                        = {
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true
#        (2 unchanged attributes hidden)

+       default_cache_behavior {
+           allowed_methods            = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           cached_methods             = [
+               "GET",
+               "HEAD",
            ]
+           compress                   = true
+           default_ttl                = 60
+           max_ttl                    = 31536000
+           min_ttl                    = 0
+           target_origin_id           = "************************************"
+           trusted_key_groups         = []
+           trusted_signers            = []
+           viewer_protocol_policy     = "redirect-to-https"
#            (1 unchanged attribute hidden)

+           forwarded_values {
+               headers                 = [
+                   "Access-Control-Request-Headers",
+                   "Access-Control-Request-Method",
+                   "Origin",
                ]
+               query_string            = false
+               query_string_cache_keys = []

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = (known after apply)
+           minimum_protocol_version       = "TLSv1.2_2021"
+           ssl_support_method             = (known after apply)
        }
    }

  # module.cdn_redirect.aws_cloudfront_origin_access_identity.default[0] will be created
+   resource "aws_cloudfront_origin_access_identity" "default" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "softkitit-prod-redirect-softkit-core"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # module.cdn_redirect.aws_s3_bucket.origin[0] will be created
+   resource "aws_s3_bucket" "origin" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "softkitit-prod-redirect-softkit-core-origin"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes"  = "origin"
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core-origin"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       tags_all                    = {
+           "Attributes"  = "origin"
+           "Environment" = "prod"
+           "Name"        = "softkitit-prod-redirect-softkit-core-origin"
+           "Namespace"   = "softkitit"
+           "Repository"  = "softkit-core"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       website {
+           redirect_all_requests_to = "https://docs.softkit.dev"
        }
    }

  # module.cdn_redirect.aws_s3_bucket_acl.origin[0] will be created
+   resource "aws_s3_bucket_acl" "origin" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)
    }

  # module.cdn_redirect.aws_s3_bucket_cors_configuration.origin[0] will be created
+   resource "aws_s3_bucket_cors_configuration" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "www.docs.softkit.dev",
            ]
+           expose_headers  = [
+               "ETag",
            ]
            id              = null
+           max_age_seconds = 3600
        }
    }

  # module.cdn_redirect.aws_s3_bucket_ownership_controls.origin[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "origin" {
+       bucket = "softkitit-prod-redirect-softkit-core-origin"
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.cdn_redirect.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = "softkitit-prod-redirect-softkit-core-origin"
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.cdn_redirect.aws_s3_bucket_public_access_block.origin[0] will be created
+   resource "aws_s3_bucket_public_access_block" "origin" {
+       block_public_acls       = true
+       block_public_policy     = false
+       bucket                  = "softkitit-prod-redirect-softkit-core-origin"
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = false
    }

  # module.cdn_redirect.aws_s3_bucket_server_side_encryption_configuration.origin[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.cdn_redirect.aws_s3_bucket_versioning.origin[0] will be created
+   resource "aws_s3_bucket_versioning" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Disabled"
        }
    }

  # module.cdn_redirect.random_password.referer[0] will be created
+   resource "random_password" "referer" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 32
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.cdn_redirect.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
+   resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
+       create_duration  = "30s"
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

  # module.cdn.module.dns.aws_route53_record.default["docs.softkit.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = false
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "docs.softkit.dev"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.cdn.module.dns.aws_route53_record.ipv6["docs.softkit.dev"] will be created
+   resource "aws_route53_record" "ipv6" {
+       allow_overwrite = false
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "docs.softkit.dev"
+       type            = "AAAA"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.cdn_redirect.module.dns.data.aws_route53_zone.default[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "default" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
        name                       = null
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = "*********************"
    }

  # module.cdn_redirect.module.dns.aws_route53_record.default["www.docs.softkit.dev"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = false
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "www.docs.softkit.dev"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.cdn_redirect.module.dns.aws_route53_record.ipv6["www.docs.softkit.dev"] will be created
+   resource "aws_route53_record" "ipv6" {
+       allow_overwrite = false
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "www.docs.softkit.dev"
+       type            = "AAAA"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "project_name" but a value
was found in file "vars/prod.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with module.cdn.aws_s3_bucket.origin[0],
  on /tmp/terraform-data-dir/modules/cdn/main.tf line 248, in resource "aws_s3_bucket" "origin":
 248: resource "aws_s3_bucket" "origin" {

Use the aws_s3_bucket_website_configuration resource instead

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR on main for docs #5](https://github.com/softkitit/softkit-core/actions/runs/9469416396)